The  IExternalEventHandler  type exposes the following members.
 Methods
Name  |   Description
Execute
 This method is called to handle the external event.
GetName
 String identification of the event handler.
 See Also
  IExternalEventHandler Interface
  Autodesk.Revit.UI Namespace